#+TITLE:  An Introduction to Recursion Schemes
#+AUTHOR: Patrick Thomson
#+EMAIL:  patrick.william.thomson@gmail.com
#+DATE:   <2014-02-15>
#+LANGUAGE: en

#+OPTIONS: ':t

#+PANDOC_OPTIONS: wrap:none atx-headers:t
#+PANDOC_EXTENSIONS: markdown-smart+footnotes-fenced_code_attributes

In 1991, Erik Meijer, Maarten Fokkinga, and Ross Paterson published their now-classic paper /[[https://eprints.eemcs.utwente.nl/7281/01/db-utwente-40501F46.pdf][Functional Programming with Bananas, Lenses, Envelopes and Barbed Wire]]/. Though this paper isn't widely known outside of the functional programming community, its contributions are astonishing: the authors use category theory to express a set of simple, composable combinators, called recursion schemes, that automate the process of traversing and recursing through nested data structures. Though recursion schemes predate Meijer et. al's work, this paper brings the enormous abstractive power of category theory to bear on the subject of traversing data structures---it's a magnificent example of how category-theoretical concepts can bring both rigor and simplicity to day-to-day programming tasks.

* Fixed Points

Consider the Y-combinator. Given a function f that takes one argument, =y(f)= represents the result of repeatedly applying =f= to itself:

#+BEGIN_SRC
y f = f (f (f (f ...)))
#+END_SRC

The sharp-eyed will have noticed that the expansion of =y(f)= is very similar to our =NestedExpr= type above. If we have a Y-combinator embedded entirely /in the type system/, we can describe the repeated application of =Expr= to itself, in a manner identical to how the value-level Y-combinator operators on functions, and in turn we can describe an =Expr a= where =a= represents arbitrarily-nested =Expr=s.

#+BEGIN_SRC haskell
type Y t = t (t (t (t (t ...))))
#+END_SRC

This general concept[fn:fixed] is known as 'fixed-point': we say that =y(f)= is the fixed point (or fixpoint) of the =f= function, and that =Y Expr= is the /fixed point of the =Expr= functor/. And here's the kicker---we can build a Y-combinator that works /in the type system/ too, and that's is how we will express the self-similar nature of an =Expr='s subexpressions.

We need a data type =Y= that, when given another type =f=, wraps an =f= whose children are of type =(Y f)=. Let's call it =Term=, and let's call its constructor =In=, representing the fact that we are stuffing one level of recursion into a fixed form. In addition, we'll define an =out= function that unwraps a =Term=.

#+BEGIN_SRC haskell
data Term f = In (f (Term f))

out :: Term f -> f (Term f)
out (In t) = t
#+END_SRC


It's illuminating to substitute =Expr= in for the type variable =f= in this equation, in order to see what it looks like to construct and deconstruct the fixed-point of an =Expr= value. Using GHC's =TypeApplications= extension to specialize =f= to et's ask GHCi the type signature of =In= over =ExprF= values.

#+BEGIN_SRC haskell :results output :exports both
:t In @ExprF :: ExprF (Term ExprF) -> Term ExprF
#+END_SRC

#+RESULTS:
: In @ExprF :: ExprF (Term ExprF) -> Term ExprF

This tells us that in order to end up with a =Term ExprF= we have to pass an =ExprF= that, if it has children, contains further values of type =Term ExprF=. We apply this =In= constructor at each level of a nested =ExprF=. This allows us arbitrarily-nested types, while still permitting the vastly-convenient =Functor= instance and its attendant =fmap=.

The type =Term ExprF= will show up often, since it is the type equivalent to our old definition of =Expr=. Let's declare a type synonym for this.

#+BEGIN_SRC haskell :tangle ../src/Part1.hs
type Expr' = Term ExprF
#+END_SRC

A more idiomatic way to declare =Term= is to use a record field rather than declaring an unwrapper function, and to make this declaration a =newtype=, which allows GHC to optimize out construction and deconstruction of =Term= values with =In= and =out=.

#+BEGIN_SRC haskell :tangle ../src/Part1.hs
newtype Term f = In { out :: f (Term f) }
#+END_SRC

#+BEGIN_SRC haskell :tangle ../src/Part1.hs :exports none
-- These instances are pretty sinful, but we'll use them for now
-- rather than complicating things with Eq1 and Show1.
deriving instance (Eq (f (Term f))) => Eq (Term f)
deriving instance (Show (f (Term f))) => Show (Term f)
#+END_SRC

From these definitions, we can see that, given a =Term Expr=, we can use the =out= function to convert it to an =Expr= the subexpressions of which are, in turn =Term Expr= values. That means that we can unwrap a =Term Expr= into an /arbitrarily-nested/ =Expr= through successive applications of =out=: our =Term Expr= can expand into an =Expr (Term Expr)=, which can expand into an =Expr (Expr (Term Expr))=, and so on and so forth. This style of defining recursive types using fixed-points of functors is an example of /codata/. A full discussion of the theory behind codata (and the many different forms that codata can take) is, unfortunately, beyond the scope of this article; I recommend [[http://www.tac-tics.net/data-vs-codata][this]] excellent introduction.

